{"hed":"The Evolution of Baseball’s Perfect Lineup","byline":"By <a href=https://pudding.cool/author/neil-paine/ target=_blank>Neil Paine</a> and <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>","body":[{"type":"text","value":"For most of baseball history, there was a set pattern to who would play what role in the batting lineup, passed down to managers through decades of experience playing and coaching the game. Speedsters would always lead off at the top of the order, for instance, while powerful sluggers would hit later on. But those rules are changing as baseball evolves, especially with analytics being used more to guide decisions. As a result, new patterns are being formed, with new archetypes for who might fill each spot in the order."},{"type":"text","value":"To get a sense of how things have shifted in a relatively short period of time, let’s look at a classic team that typified the old way of building a lineup — and which would probably line up very differently in the modern era: the World Champion <a href=https://www.baseball-reference.com/teams/TOR/1993.shtml target=_blank>1993 Toronto Blue Jays</a>."},{"type":"scroll","value":[{"type":"text","value":"This is the batting lineup of the ‘93 Blue Jays, who beat the Philadelphia Phillies on <a href=https://www.youtube.com/watch?v=-F5HwiGm7lg target=_blank>Joe Carter’s famous game-winning home run</a> in Game 6 of the World Series."},{"type":"text","value":"<span class=player>Carter</span> was the classic cleanup hitter of that era: A pure slugger who didn’t walk much, or even hit for a very high average, but could hit the ball out of the yard. He was joined in the batting order by other archetypal players for their lineup slot, from <span class=player>Rickey Henderson</span> — widely regarded as the greatest leadoff man ever — and speedster <span class=player>Devon White</span> high in the lineup, and all-around hitters <span class=player>Robbie Alomar</span>, <span class=player>John Olerud</span> and <span class=player>Paul Molitor</span> in the middle of the order."},{"type":"text","value":"But with the rules around lineup construction changing, those Blue Jays might not look the same in 2024."},{"type":"text","value":"We rated each player relative to the league on a 0-5 scale in four major categories: Hitting for average and power, walks and speed. Using those ratings, we grouped players by their lineup slot, and looked for the traits that each spot in the order had in common — and how that has changed over time. Those trends allowed us to then predict where a batter with a particular set of skills might tend to bat, depending on the era."},{"type":"text","value":"We put that concept to work by estimating how Toronto's old-school lineup order might change if they played today. Here's what our algorithm thinks might be the lineup for the hypothetical “2024” Toronto Blue Jays."},{"type":"text","value":"Because speed and batting average are less prioritized at leadoff, <span class=player>Tony Fernandez</span> has become Toronto’s most likely leadoff hitter. <span class=player>Henderson</span> and <span class=player>White</span> shift lower, as teams have been more willing to bat their better hitters deeper in the order in recent seasons."},{"type":"text","value":"<span class=player>Olerud</span> and <span class=player>Molitor</span> move up due to their all-around skills, and <span class=player>Alomar</span> becomes the centerpiece of the modern analytical lineup in the No. 2 hole."},{"type":"text","value":"And <span class=player>Carter</span>, who would likely be penciled in further down in the lineup, may never have gotten the chance to hit that iconic HR from the cleanup spot."}]},{"type":"text","value":"That’s just one example. Plenty of other teams and players would be known for different spots in the order if they plied their trade in today’s more analytically oriented era of baseball. So let’s run through the old and new rules for building a lineup, using players at each spot who best typified the types of skills managers were looking for in each role by era:"},{"type":"sections","value":[{"id":"1","title":"Batting 1st","text":[{"type":"text","value":"Managers used to prize speed at the top of the lineup over just about everything else. Leadoff hitters needed to get on base too — preferably by rapping out a single, because swinging-and-missing was taboo. But once a leadoff hitter was standing on first, they needed to be able to steal second even when the pitcher and catcher knew they were going to take off."},{"type":"text","value":"But nowadays, managers want slightly more power out of their leadoff hitters, and they’re willing to trade some speed for it. A few modern No. 1 hitters can do it all, stealing bases and hitting home runs in equal measure — Mookie Betts of the Dodgers and Ronald Acuña Jr. of the Braves are great examples of this — but they are rare talents. More commonly, you will see a player like Semien, who gets on base with walks and hits with above-average power in addition to his decent running speed, penciled in atop the lineup."}],"cards":[{"name":"Rickey Henderson","blurb":"Henderson is MLB's all-time leader in stolen bases and runs scored."},{"name":"Kenny Lofton","blurb":"Lofton played college basketball at Arizona, going to the Final Four in 1988."},{"name":"Brett Butler","blurb":"After being diagnosed with cancer in May 1996, Butler underwent surgery and treatment, and returned to play by September of the same season."},{"name":"Mookie Betts","blurb":"Betts is an avid bowler."},{"name":"Ichiro Suzuki","blurb":"Ichiro had more than 4,000 hits as a professional across his career in Japan and the United States."},{"name":"Ronald Acuña Jr.","blurb":"In 2023, Acuña became MLB’s first member of the 40 HR/70 SB club."}]},{"id":"2","title":"Batting 2nd","text":[{"type":"text","value":"The classic No. 2 hitter is all about “bat control”. That might mean hitting for a solid average, as Ozzie Smith, “The Wizard of Oz”, often did in his career. But it might also mean deliberately hitting the ball “behind the runner” to reduce the risk of a double play — or even to lay down a perfect sacrifice bunt. The important thing was to make sure the leadoff hitter got into scoring position for the big bats to drive in later. And a little speed from this spot never hurts, either, especially since it helps those ground balls turn into infield hits."},{"type":"text","value":"No place in the lineup showcases how the game has changed more than the No. 2 slot. Remember how the second spot in the order used to be all about making contact and moving runners over? Now, the <a href=https://www.beyondtheboxscore.com/2009/3/17/795946/optimizing-your-lineup-by target=_blank>data say</a> that your best overall hitter should hit second more often — and not always third, as originally believed. At the No. 2 spot, they will come to the plate more often, and less frequently with two outs. This is why better overall hitters — and especially better power hitters, like Trout, Seager and Ohtani — are hitting in the 2-hole than they ever did in the past."}],"cards":[{"name":"Ozzie Smith","blurb":"The “Wizard of Oz” also won 13 Gold Gloves as a fielder, the most of any SS ever."},{"name":"Derek Jeter","blurb":"Jeter was also penciled in at No. 2 (behind George Clooney) on People magazine’s inaugural list of Most Eligible Bachelors in 2000."},{"name":"Jay Bell","blurb":"On July 11, 1999, Arizona resident Gylene Hoyle won $1 million in a radio contest by correctly picking Bell to hit a home run in the sixth inning against the Oakland A’s."},{"name":"Corey Seager","blurb":"Seager won 2 World Series MVPs — with two different teams! — while batting out of the 2-hole."},{"name":"Mike Trout","blurb":"Trout became the best player of the 2010s (according to Wins Above Replacement) while primarily batting second in the Angels’ lineup."},{"name":"Dustin Pedroia","blurb":"In 2008, Pedroia led MLB in hits and had the fifth-most doubles (54) ever in a season by a player standing 5’9” or shorter."}]},{"id":"3","title":"Batting 3rd","text":[{"type":"text","value":"The No. 3 slot was traditionally reserved for the best hitter — or, more generally, the biggest star among batters — on the team. In the 3-hole, you were expected to hit for power and average, driving in the leadoff man if he was on base, or setting up the cleanup hitter for RBI chances of his own. It was a matter of pride for big names to bat in this slot."},{"type":"text","value":"However, as a result of research showing that top all-around hitters should bat second, the 3-hole has lost some of its prestige. Today’s No. 3 hitters are no slouches, of course. But as more players with a mix of elite skills get moved elsewhere, teams now tend to place greater focus on one particular attribute here, asking less of the role in terms of speed and other facets of the game."}],"cards":[{"name":"George Brett","blurb":"A 1976 photograph of Brett inspired the New Zealand singer Lorde to write her hit song “Royals”."},{"name":"Jeff Bagwell","blurb":"Bagwell had a highly recognizable batting stance, in which he spread his legs wide and crouched low to the ground before unleashing a mighty swing."},{"name":"Ken Griffey Jr.","blurb":"With his backwards cap and sweet swing, “Junior” was widely regarded as the coolest player of the ‘90s."},{"name":"Miguel Cabrera","blurb":"In 2012, Cabrera won AL MVP while becoming MLB’s first Triple Crown winner in 45 years."},{"name":"Joey Votto","blurb":"Votto led the National League in on-base percentage seven times and is one of only 63 players with a career OBP over .400."},{"name":"José Bautista","blurb":"Bautista was baseball’s greatest late bloomer, with the fewest WAR through age 27 of any batter who eventually compiled 30+ career WAR."}]},{"id":"4","title":"Batting 4th","text":[{"type":"text","value":"Other than Leadoff, this is the only spot with its own nickname: the Cleanup Hitter. That’s because No. 4 hitters “clean up the bases” by slugging home the runners in front of them. Historically, power has always been the most important attribute in the cleanup spot, with on-base percentage taking on less significance because the job of slots 1-3 was to get on base and set the table for the cleanup hitter. Even strikeouts were more tolerated here, if it meant a trade-off for more power. And cleanup hitters didn’t traditionally need to be fast."},{"type":"text","value":"But the cleanup role is changing a lot recently. It’s still a place for some teams to put burly sluggers, to be sure, but the typical No. 4 hitter is now less powerful — and patient — than in the 1990s. (It’s also getting very slightly faster on average, weirdly enough.) In fact, no lineup slot has seen a bigger decline in <a href=https://library.fangraphs.com/offense/wrc/ target=_blank>Weighted Runs Created Plus</a> — a measure of batting effectiveness relative to league average — than the cleanup spot since then."}],"cards":[{"name":"Manny Ramirez","blurb":"One of Ramirez’s most memorable plays involved him running down a fly ball in deep left field, making the catch, scaling the wall and high-fiving a fan before throwing the ball back in."},{"name":"Eddie Murray","blurb":"Among switch-hitters who hit 300 or more career home runs, Murray and Mickey Mantle are the only ones with at least 140 HRs from both sides of the plate."},{"name":"Fred McGriff","blurb":"The “Crime Dog” ignited the 1993 Braves to a comeback in the standings after their home stadium caught fire the day he arrived via trade."},{"name":"Prince Fielder","blurb":"In 2007, Fielder joined his father Cecil in the 50 HR club, the only father-son duo to ever both reach that threshold. (Prince and Cecil also each finished their careers with exactly 319 HR apiece.)"},{"name":"Adrián Beltré","blurb":"Along with Willie Mays, Carl Yastrzemski and Dave Winfield, Beltré is one of four players with 3,000+ career hits, 400+ home runs and 5 or more Gold Glove awards on defense."},{"name":"Khris Davis","blurb":"In one of the most mind-boggling statistical coincidences ever seen in sports, Davis hit exactly .247 in four consecutive seasons from 2015 to 2018."}]},{"id":"5-7","title":"Batting 5th-7th","text":[{"type":"text","value":"Nos. 5-7 are where the lineup gets flexible, with managers often using those slots as lesser versions of the cleanup spot — perhaps featuring a power hitter with a poor batting average or a low walk rate. One traditional rule was also to alternate the handedness of these spots depending on which side of the plate the cleanup hitter batted from: So a lefty No. 4 hitter would be followed by a righty No. 5, a lefty No. 6 and so forth, to ensure that the opposing manager couldn’t neutralize an entire block of the lineup with one reliever late in games."},{"type":"text","value":"In the modern game, these slots have undergone a surprising evolution: From a place for plodding sluggers to a spot to stash speedsters! As power bats have begun to take over the leadoff slot, batters who would have been leadoff hitters in an earlier era are increasingly moving down the order — and they often get penciled in at Nos. 5-7 now."}],"cards":[{"name":"Graig Nettles","blurb":"In September 1974, Nettles was suspended 10 days for “corking” his bat —  hollowing it out and filling it with bouncy superballs."},{"name":"Robin Ventura","blurb":"Ventura’s most famous hit was a walk-off grand slam that only counted as a single because his Mets teammates mobbed him before he could get to home plate."},{"name":"Ron Cey","blurb":"Cey was nicknamed “The Penguin” because his running form resembled that of a waddling, flightless Antarctic bird."},{"name":"Yadier Molina","blurb":"Collectively along with siblings Bengie and José, the Molina Brothers caught an astounding 4,384 major-league games behind the plate."},{"name":"Brandon Crawford","blurb":"Crawford batted 9th when the Giants won the 2012 World Series and 8th when they won again in 2014, but later he spent the majority of his best seasons batting either 5th, 6th or 7th."},{"name":"Howie Kendrick","blurb":"Coming from the 5-hole in the Nats’ order, Kendrick’s go-ahead HR in the seventh inning of Game 7 in the 2019 World Series added 33 percentage points to Washington’s championship chances, making it the 13th-most impactful play in MLB history by that measure."}]},{"id":"8-9","title":"Batting 8th-9th","text":[{"type":"text","value":"In an earlier era of the game, these lineup slots were defined by holding the worst hitters on the team. (Quite literally, back when National League pitchers hit — they would almost always hit ninth, with the only exception being when oddball managers like Joe Maddon or Tony La Russa <a href=https://www.espn.com/mlb/story/_/id/13004137/why-manager-joe-maddon-bats-pitcher-eighth-chicago-cubs-lineup target=_blank>batted the pitcher eighth</a>.) The best that could be said for them back then was that an 8-hole hitter in the NL would be a veteran who was OK with not getting many pitches to hit in front of the pitcher, or a No. 9 batter in the AL profiling as a “second leadoff hitter” coming up in front of the <i>actual</i> leadoff man."},{"type":"text","value":"But these spots are gaining ground on the rest of the lineup during the analytics era, even after accounting for the absence of hitting pitchers from the game nowadays. Already speedy, they’ve gotten faster (again, you have to stash the batters who formerly would have hit leadoff <i>somewhere</i>), and AL No. 9 hitters walk more than ever — another sign that modern managers are spreading their batting talent more evenly throughout the lineup."}],"cards":[{"name":"Ozzie Guillen","blurb":"Guillen, who later went on to manage the White Sox and Marlins, holds the career record for most games penciled into the No. 9 hole (1,185)."},{"name":"Bucky Dent","blurb":"Dent was batting 9th for the Yankees on October 2, 1978, when he hit the HR that buried the Red Sox in the AL East tie-breaker game."},{"name":"Cesar Izturis","blurb":"Izturis was a lifer in the No. 8 and 9 slots, recording 98.7% of his career PA there (73.7% in 9th and 25.0% in 8th)."},{"name":"Kevin Kiermaier","blurb":"By Baseball-Reference’s accounting, Kiermaier is the sixth-best defensive center fielder of all time, saving 176 runs as compared with an average defender."}]}]},{"type":"methods","value":[{"type":"text","value":"To rate each player’s skill set, we first needed a collection of statistics that measured performance in each area of the game. To that end, we tied the following attributes to specific metrics, all adjusted relative to the league:"},{"type":"text","value":"* Hitting for Average: Batting average (a classic stat showing the player’s ratio of hits to at-bats)"},{"type":"text","value":"* Hitting for Power: Isolated power (a measure that tracks a player’s extra-base hits per AB)"},{"type":"text","value":"* Drawing Walks: Walk rate (the percentage of the player’s plate appearances that end in a walk)"},{"type":"text","value":"* Running Speed: Speed score (a stat created by Bill James, the godfather of Sabermetrics, which <a href=https://library.fangraphs.com/offense/spd/ target=_blank>estimates a player’s speed</a> from various different other statistics)"},{"type":"text","value":"In each season, players are rated in each category on a 0-5 scale based on their percentile grade (relative to the entire league) in the category. Those skill scores are what appear on the charts and player cards above."},{"type":"text","value":"Then, we put the skill scores in a <a href=https://en.wikipedia.org/wiki/Logistic_regression target=_blank>logistic regression</a> model that attempted to predict the probability of a player with any given profile batting at each slot in the order. Those models were conducted on data from two different eras: The Sabermetrics Era of MLB (2010-present), when teams began the widespread use of analytics to help construct their lineups; and the Old-School Era (1970-2009), when teams still made decisions based on gut instinct and received wisdom."},{"type":"text","value":"With those regressions, we can see how a player with the exact same breakdown of skills might bat in two very different places in the order, depending on whether the manager was thinking about the traditional rules of lineup construction or basing their decisions on more analytics-driven research."}]}]}